Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.GetFlangeThicknessInFlangeCenter
Returns thickness of flange measured in the 0.25 * (width - webThickess),
sometimes used for sections with width > 300 mm.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.GetFlangeThicknessInQuarterWidth
Returns thickness of flange measured in the 0.25 * width,
sometimes used for sections with width <= 300 mm.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.SlopedFlangeAngle
Sloped flange angle. (rad)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.WebToeOfFillet
Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.FlangeToeOfFillet
Detailing distance from center of web to flange toe of fillet, in. (mm)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.FlangeFillet
Flange Fillet - fillet radius at the flange end.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Structural Section I Sloped Flange shape with the associated set of parameters,
used to attach to structural element.
width:
Section width.
height:
Section height, depth.
flangeThickness:
Flange Thickness.
flangeThicknessLocation:
Flange Thickness Location.
flangeFillet:
Flange Fillet - fillet radius at the flange end.
flangeToeOfFillet:
Detailing distance from center of web to flange toe of fillet, in. (mm).
slopedFlangeAngle:
Sloped flange angle. (rad)
webThickness:
Web Thickness.
webFillet:
Web Fillet - fillet radius between web and flange.
webToeOfFillet:
Detailing distance from outer face of flange to web toe of fillet, in. (mm)
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
Defines parameters for general Double T shape.
Since:
2018